<?php

//$numJoueur = $_POST['numJoueur'];
$numJoueur = 1;

$currentGrid = [
//  0   1  2  3  4  5  6  7  8  9 10 11  12 13 14 15 16 17 18
    [0, 0, 0, 0, 0, 2, 2, 1, 0, 1 ,1 ,1 , 0, 0, 0, 0, 0, 0, 0],//0
    [0, 0, 0, 0, 2, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//1
    [0, 0, 0, 0, 2, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//2
    [0, 0, 0, 0, 1, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//3
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//4
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//5
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//6
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//7
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//8
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//9
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//10
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//11
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//12
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//13
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//14
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//15
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//16
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0],//17
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 , 0, 0, 0, 0, 0, 0, 0]//18
];


$pts = [];
$i = 0;
foreach($currentGrid as $ligne) {
    $j = 0;
    foreach($ligne as $cell) {
        if ($cell == $numJoueur) {
            $pts[] = [$i, $j]; // X ; Y
        }
        $j++;
    }
    $i++;
}
//var_dump($pts);
checkLine($pts);

function checkLine($pts_user) {
  $datas_grouped = array();
  foreach ($pts_user as $p) {
    if (!isset($datas_grouped[$p[0]])) {
      $datas_grouped[$p[0]] = array($p[1]);
    } else {
      $datas_grouped[$p[0]][] = $p[1];
    }
    rsort($datas_grouped[$p[0]]);  // tri ordonnées
  }
  //var_dump($datas_grouped);

  foreach ($datas_grouped as $abs => $ordonnees) {
    var_dump($abs);
    var_dump($ordonnees);
    $size_ords = count($ordonnees);
    var_dump($size_ords . " éléments");
    if ($size_ords > 1) {
      foreach ($ordonnees as $ord) {
        var_dump($ord);
      }
    } else {
      // peut pas être exploité car 1 seul élément
    }
  echo('<br>_________________________________<br>');
  }

}
?>
